
### :robot: Terraform Report
---
##### Plan: `5` to add, `0` to change, `2` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.istio_base[0] is tainted, so must be replaced
-/+ resource "helm_release" "istio_base" {
      ~ id                         = "istio-base" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "1.23.2"
              - chart          = "base"
              - first_deployed = 1728854010
              - last_deployed  = 1728854010
              - name           = "istio-base"
              - namespace      = "istio"
              - notes          = <<-EOT
                    Istio base successfully installed!
                    
                    To learn more about the release, try:
                      $ helm status istio-base -n istio
                      $ helm get all istio-base -n istio
                EOT
              - revision       = 1
              - values         = jsonencode({})
              - version        = "1.23.2"
            },
        ] -> (known after apply)
        name                       = "istio-base"
      ~ namespace                  = "istio" -> "istio-system"
      ~ status                     = "failed" -> "deployed"
        # (24 unchanged attributes hidden)
    }

  # helm_release.istio_gateway[0] will be created
  + resource "helm_release" "istio_gateway" {
      + atomic                     = false
      + chart                      = "gateway"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-gateway"
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.23.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.istiod[0] will be created
  + resource "helm_release" "istiod" {
      + atomic                     = false
      + chart                      = "istiod"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-istiod"
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.23.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.prometheus[0] will be created
  + resource "helm_release" "prometheus" {
      + atomic                     = false
      + chart                      = "prometheus"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "25.27.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_namespace.namespace-istio must be replaced
-/+ resource "kubernetes_namespace" "namespace-istio" {
      ~ id                               = "istio" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
          ~ name             = "istio" -> "istio-system" # forces replacement
          ~ resource_version = "87762" -> (known after apply)
          ~ uid              = "994b05b8-faae-42d2-b548-ae06397c21ad" -> (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 2 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11317880230`](https://github.com/innovats-hub/system-apps-aks/actions/runs/11317880230) - commit 08ddaefdcad9f21083acb048bf9bf9b084361a30
